<a href="https://colab.research.google.com/github/RubensJr21/FCS/blob/master/FCS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Instalando Pandas

In [ ]:
pip install pandas

Importando Bibliotecas

In [ ]:
import psycopg2
import pandas as pd

Configurando conexão

In [ ]:
conn = psycopg2.connect(host="ziggy.db.elephantsql.com", database="nyqfvagr", user="nyqfvagr", password="9yUpXiE_j6BFpGqKKjlvRcQWFPLLSRIC")

Consultando Informações do Banco de dados.

Objetivo: Obter informações da tabela FUNCIONARIO

In [ ]:
resultado1 = pd.read_sql_query("select * from FUNCIONARIO",conn)

In [ ]:
resultado1

    id       nome_sobrenome senha     funcao
0  id1         Ana da Silva  1234  Atendente
1  id2  João Pedro da Silva  1234  Atendente
2  id3        Helena Soares  1234    Gerente
3  id4  Maria Eduarda Gomes  1234  Atendente
4  id5    Fernando Ferreira  1234    Gerente
5  id6         Cláudia Lima  1234  Atendente
6  id7         Alice Vieira  1234  Atendente
7  id8       Antonio Carlos  1234  Atendente
8  id9         Felipe Gomes  1234  Atendente
9  id0           Luana Dias  1234  Atendente

Objetivo: Obter informações da tabela VENDA

In [ ]:
resultado2 = pd.read_sql_query("select * from VENDA",conn)

In [ ]:
resultado2

   id fk_clientes_id fk_funcionarios_id  ...  total fk_pedido_estado_id obs
0   1            idA                id2  ...  50.00                  21
1   2            idA                id3  ...  35.99                  22
2   3            idA                id4  ...  23.15                  23
3   4            idA                id5  ...  14.26                  24
4   5            idA                id6  ...  10.14                  25
5   6            idA                id7  ...  22.99                  26
6   7            idA                id8  ...  64.50                  27
7   8            idA                id9  ...  14.99                  28
8   9            idA                id2  ...  14.99                  29
9  10            idA                id1  ...  23.99                  30

[10 rows x 11 columns]

Objetivo: Obter informações da tabela PRODUTO

In [ ]:
resultado3 = pd.read_sql_query("select * from PRODUTO",conn)

In [ ]:
resultado3

     id       nome  valor fk_categorias_id  active
0  idP1   produto1  15.99               cA    True
1  idP2   produto2  10.35               cB   False
2  idP3   produto3  18.40               cC    True
3  idP4   produto4  21.99               cD   False
4  idP5   produto5  13.99               cE    True
5  idP6   produto6   9.99               cF    True
6  idP7   produto7  23.50               cG    True
7  idP8   produto8  14.46               cH    True
8  idP9   produto9  15.35               cI   False
9  idP0  produto10  20.15               cJ    True

Objetivo: Obter informações da tabela CATEGORIA

In [ ]:
resultado4 = pd.read_sql_query("select * from CATEGORIA",conn)

In [ ]:
resultado4

   id   tipo
0  cA  tipoA
1  cB  tipoB
2  cC  tipoC
3  cD  tipoD
4  cE  tipoE
5  cF  tipoF
6  cG  tipoG
7  cH  tipoH
8  cI  tipoI
9  cJ  tipoJ

Objetivo: Obter informações da tabela CLIENTE

In [ ]:
resultado5 = pd.read_sql_query("select * from CLIENTE",conn)

In [ ]:
resultado5

    id      nome           sobrenome   telefone  fk_enderecos_id
0  idA     Maria            da Silva  3222-3531                1
1  idB     Alice      Soares Barreto  3233-3332                2
2  idC     Jonas           Gonçalves  3531-2826                3
3  idD  Fernando             Menezes  3222-7412                4
4  idE     Lucas       Ferreira Lima  3635-3839                5
5  idF    Mateus        Vieira de Sá  3233-3134                6
6  idG  Clarisse    Alencar de Souza  3230-3534                7
7  idH    Thiago     Alves Rodrigues  3738-3231                8
8  idI  Humberto      Rocha Siqueira  3532-2224                9
9  idJ    Felipe  Andrade de Azevedo  3222-4541               10

Objetivo: Obter informações da tabela ENDERECO

In [ ]:
resultado6 = pd.read_sql_query("select * from ENDERECO",conn)

In [ ]:
resultado6

   id     tipo        lougradoro_nome  ...  estados_uf complemento      cep
0   1      Rua        Lírio dos Vales  ...          ES      Fundos  2900000
1   2  Avenida             Lima Silva  ...          ES     Apt 104  2900300
2   3  Avenida      Avenida Aparecida  ...          ES      Apt 34  2900300
3   4      Rua       Constante Sodré   ...          ES     Apt 230  2900000
4   5      Rua        Anacleto Soares  ...          ES        Casa  2900400
5   6  Avenida            Coelho Mota  ...          ES     Apt 104  2900300
6   7  Avenida             Navegantes  ...          ES     Apt 104  2900000
7   8      Rua            Aleixo Neto  ...          ES     Apt 205  2900300
8   9  Avenida           Soares Souza  ...          ES        casa  2900500
9  10  Avenida  Avenida Barreto Couto  ...          ES        casa  2900900

[10 rows x 9 columns]

Objetivo: Obter informações da tabela VENDA_PRODUTO

In [ ]:
resultado7 = pd.read_sql_query("select * from VENDA_PRODUTO",conn)

In [ ]:
resultado7

  fk_produtos_id  fk_vendas_id  qtd  valor   sabor obs
0           idP1             1    3    4.0  sabor1
1           idP1             2    3    3.0  sabor1
2           idP1             2    3    2.0  sabor1
3           idP1             2    3    1.0  sabor1
4           idP1             3    3    1.0  sabor1
5           idP1             4    3    1.0  sabor1
6           idP1             5    3    1.0  sabor1
7           idP1             1    3    1.0  sabor1

Objetivo: Obter informações da tabela PEDIDO_ESTADO

In [ ]:
resultado8 = pd.read_sql_query("select * from PEDIDO_ESTADO",conn)

In [ ]:
resultado8

   id    status
0  21   status1
1  22   status2
2  23   status3
3  24   status4
4  25   status5
5  26   status6
6  27   status7
7  28   status8
8  29   status9
9  30  status10

Objetivo: Obter informações da tabela FORMA_DE_PAGAMENTO

In [ ]:
resultado9 = pd.read_sql_query("select * from FORMA_DE_PAGAMENTO",conn)

In [ ]:
resultado9

       tipo
0    cartao
1  dinheiro

Objetivo: Obter informações da tabela ESTOQUE

In [ ]:
resultado10 = pd.read_sql_query("select * from ESTOQUE",conn)

In [ ]:
resultado10

  fk_produtos_id  quantidade
0           idP1          20
1           idP2          25
2           idP3          15
3           idP4          10
4           idP5          30
5           idP6          18
6           idP7           5
7           idP8          23
8           idP9           7
9           idP0          14

Objetivo: Obter informações da tabela SABOR

In [ ]:
resultado11 = pd.read_sql_query("select * from SABOR",conn)

In [ ]:
resultado11

   id fk_produtos_id   sabor
0  21           idP1  sabor1
1  22           idP1  sabor2
2  23           idP1  sabor3
3  24           idP2  sabor1
4  25           idP2  sabor2
5  26           idP3  sabor1
6  27           idP4  sabor1
7  28           idP5  sabor1
8  29           idP6  sabor1
9  30           idP7  sabor1